ddcmd.org
#+title: DUNE DAQ Command Object Creation
#+author: Brett Viren
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style> p{max-width:800px;}</style>
#+HTML_HEAD: <style> li{max-width:800px;}</style>
#+OPTIONS:   H:4 num:nil toc:2

* Introduction

DUNE DAQ command objects must rigorously follow a defined schema.
From this schema, C++, Python and other artifacts are generated using
a command line tool or its Python package both called [[https://brettviren.github.io/moo][moo]].  With the
module, ~moo~ may generate Python object types ("otypes") from ~moo~
"oschema" (object schema) files.  These Python types are strongly
typed (for Python) and help to guide an editor to produce objects
which are valid by construction.  The types are also instrumented with
docstrings and other things to assist the human using an interactive
REPL, such as ~ipython~ or ~ptipython~, to interactively discover how to
use them.

This document goes through some of the features of ~moo~ otypes.  It
starts with some initial setup instructions and a "quick start" to
make some commands while putting aside any explanation.  The remaining
sections give information useful in making your own command objects.
They describe how to load schema and from schema create Python types
and interrogate those types to learn how to make instances.  It then
gives a tour of the schema classes with example types from ~appfwk~
schema.  Penultimate section describes the construction utilities used
in the quick start and finally some description is given of the
internals of the Python type generator.

#+begin_tip
Some ~moo~ nomenclature is used in this document.  A ~moo~ schema consists
of instances of class in a fixed set of *schema classes*.  These are
/boolean/, /string/, /number/, /enum/, /sequence/, /record/ and /any/.  An instance
of one of these classes is called a *type* which is known as by its *type
name* and which is a leaf in a namespace located through a *type path*.
In the schema, a *type* is a (meta) data structure which may then be
represented in or transformed to native programming language forms.
For example, in C++ a type is used to *generate* code for a C++ ~struct~.
In Python, the type is used to dynamically create a Python ~class~.
From the native linage types we may finally an instance of a *type* aka
an *object*.

We will also describe data types expressed in the native programming
language as "Plain Old Data" or POD.  

Thus, we may say: a /string/ schema class type ~Email~ produces an object
which holds the POD string ~"bv@bnl.gov"~.
#+end_tip

* Setup

We need to install ~moo~ and some nice REPL (here, we recommend ~ptipython~)

#+begin_example
$ python3.8 -m venv venv
$ source venv/bin/activate
$ pip install git+git://github.com/brettviren/moo.git#egg=moo
$ pip install ptipython
#+end_example

Let's also clone this repository and that of ~appfwk~.

#+begin_note
We clone ~appfwk~ here in order to access its ~schema/~ directory.  If you
have ~appfwk~ installed as a package you may already have access to this
directory and can then skip the explicit cloning.  Set ~MOO_MODULE_PATH~ if needed. 
#+end_note

#+begin_example
$ git clone https://github.com/dune-daq/appfwk.git
$ export MOO_MODULE_PATH=$(pwd)/appfwk/schema
$ git clone https://github.com/brettviren/dune-daq-repl.git
#+end_example

From now on we will run the Python REPL from inside ~dune-daq-repl/~

#+begin_example
$ cd dune-daq-repl/
$ ptipython
Python 3.8.0 (default, Oct 28 2019, 16:14:01) 
Type 'copyright', 'credits' or 'license' for more information
IPython 7.18.1 -- An enhanced Interactive Python. Type '?' for help.

In [1]: import dd
                  ddcmd 
                  ddrepl
#+end_example

Here, in a poor, uncolored ASCII facsimile, shows some of the nice REPL
features that ~ptipython~ provides.  The last two lines are a drop-down
menu of modules matching an initial ~dd~ typing.  ~Ctrl-n~ to highlight
~ddcmd~ and ~Enter~ to select.

#+begin_tip
This document is made in Emacs orgmode using ~ob-ipython~.  It may be reproduced after also running: ~pip install ipython jupyter~ and editing ~ddcmd.org~ from an instance of ~emacs~ started from the Python environment.
#+end_tip

* Quick Start

This section shows how to create one particular sequence of command
objects while leaving aside any explanation.  The remainder of the
document will fill in the background information.

#+begin_src ipython :session :exports both :results raw drawer
import ddcmd

for mod in ["cmd", "fdp", "fdc"]:
    schema = ddcmd.load_oschema(f"appfwk-{mod}-schema.jsonnet")
    these = ddcmd.make_otypes(schema)

queues = cmd.QueueSpecs([
  cmd.QueueSpec(kind='StdDeQueue', inst="hose", capacity=10)])
modules = cmd.ModSpecs([
  cmd.ModSpec(inst="source", plugin="FakeDataProducerDAQModule",
    data=cmd.QueueInfo(inst="hose", name="output", dir="output")),
  cmd.ModSpec(inst="sink", plugin="FakeDataConsumerDAQModule",
    data=cmd.QueueInfo(inst="host", name="input", dir="input"))])
myinit = ddcmd.init(queues=queues, modules=modules)

myconf = ddcmd.conf([
  cmd.AddressedCmd(match="source", data=fdp.Conf()),
  cmd.AddressedCmd(match="sink", data=fdc.Conf())])

[myinit, myconf]
#+end_src

#+RESULTS:
:results:
# Out[189]:
: [<record Command, fields: {id, data}>, <record Command, fields: {id, data}>]
:end:

This produces two command objects, one to initialize and one to
configure.  These can be fed to the ~appfwk~ app ~daq_application~.  Other
commands exist (eg, ~start~ and ~stop~).

Read on for explanation on what this quick start is doing and how to
learn to use the Python types to make your own command objects.

