ddcmd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-08 Fri 16:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DUNE DAQ Command Object Creation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren Brett Viren" />
<link rel="stylesheet" type="text/css" href="other/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="other/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">DUNE DAQ Command Object Creation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org47a56c3">Introduction</a></li>
<li><a href="#org6c27ba8">Setup</a></li>
<li><a href="#orgf93c208">Quick Start</a></li>
<li><a href="#org623bc40">Loading types</a></li>
<li><a href="#org1d861d8">Interrogating types</a></li>
<li><a href="#org113e009">Examples</a>
<ul>
<li><a href="#orgb09464f">Boolean</a></li>
<li><a href="#orga26d941">Numbers</a></li>
<li><a href="#org4e27dec">Strings</a></li>
<li><a href="#org0f0bc95">Enums</a></li>
<li><a href="#orga995aed">Records</a></li>
<li><a href="#org7d9f328">Sequences</a></li>
<li><a href="#orgf2e0a50">Anys</a></li>
</ul>
</li>
<li><a href="#orgaee67e4">Construct Commands</a>
<ul>
<li><a href="#org725a1ce">The <code>init</code> command</a></li>
<li><a href="#orgea14343">Putting <code>init</code> together</a></li>
<li><a href="#orgc5ad165">The <code>conf</code> command</a></li>
</ul>
</li>
<li><a href="#orgd8516de">Command delivery</a></li>
</ul>
</div>
</div>

<div id="outline-container-org47a56c3" class="outline-2">
<h2 id="org47a56c3">Introduction</h2>
<div class="outline-text-2" id="text-org47a56c3">
<p>
DUNE DAQ command objects must rigorously follow a defined schema.
From this schema, C++, Python and other artifacts are generated using
a command line tool or its Python package both called <a href="https://brettviren.github.io/moo">moo</a>.  With the
module, <code>moo</code> may generate Python object types ("otypes") from <code>moo</code>
"oschema" (object schema) files.  These Python types are strongly
typed (for Python) and help to guide an editor to produce objects
which are valid by construction.  The types are also instrumented with
docstrings and other things to assist the human using an interactive
REPL, such as <code>ipython</code> or <code>ptipython</code>, to interactively discover how to
use them.
</p>

<p>
This document goes through some of the features of <code>moo</code> otypes.  It
starts with some initial setup instructions and a "quick start" to
make some commands while putting aside any explanation.  The remaining
sections give information useful in making your own command objects.
They describe how to load schema and from schema create Python types
and interrogate those types to learn how to make instances.  It then
gives a tour of the schema classes with example types from <code>appfwk</code>
schema.  Penultimate section describes the construction utilities used
in the quick start and finally some description is given of the
internals of the Python type generator.
</p>

<div class="tip">
<p>
Some <code>moo</code> nomenclature is used in this document.  A <code>moo</code> schema consists
of instances of class in a fixed set of <b>schema classes</b>.  These are
<i>boolean</i>, <i>string</i>, <i>number</i>, <i>enum</i>, <i>sequence</i>, <i>record</i> and <i>any</i>.  An instance
of one of these classes is called a <b>type</b> which is known as by its <b>type
name</b> and which is a leaf in a namespace located through a <b>type path</b>.
In the schema, a <b>type</b> is a (meta) data structure which may then be
represented in or transformed to native programming language forms.
For example, in C++ a type is used to <b>generate</b> code for a C++ <code>struct</code>.
In Python, the type is used to dynamically create a Python <code>class</code>.
From the native linage types we may finally an instance of a <b>type</b> aka
an <b>object</b>.
</p>

<p>
We will also describe data types expressed in the native programming
language as "Plain Old Data" or POD.  
</p>

<p>
Thus, we may say: a <i>string</i> schema class type <code>Email</code> produces an object
which holds the POD string <code>"bv@bnl.gov"</code>.
</p>

</div>
</div>
</div>

<div id="outline-container-org6c27ba8" class="outline-2">
<h2 id="org6c27ba8">Setup</h2>
<div class="outline-text-2" id="text-org6c27ba8">
<p>
We need to install <code>moo</code> and some nice REPL (here, we recommend <code>ptipython</code>)
</p>

<pre class="example">
$ python3.8 -m venv venv
$ source venv/bin/activate
$ pip install git+git://github.com/brettviren/moo.git#egg=moo
$ pip install ptipython
</pre>

<p>
Let's also clone this repository and that of <code>appfwk</code>.
</p>

<div class="note">
<p>
We clone <code>appfwk</code> here in order to access its <code>schema/</code> directory.  If you
have <code>appfwk</code> installed as a package you may already have access to this
directory and can then skip the explicit cloning.  Set <code>MOO_MODEL_PATH</code> if needed. 
</p>

</div>

<pre class="example">
$ git clone https://github.com/dune-daq/appfwk.git
$ export MOO_MODEL_PATH=$(pwd)/appfwk/schema
$ git clone https://github.com/brettviren/dune-daq-repl.git
</pre>

<p>
From now on we will run the Python REPL from inside <code>dune-daq-repl/</code>
</p>

<pre class="example">
$ cd dune-daq-repl/
$ ptipython
Python 3.8.0 (default, Oct 28 2019, 16:14:01) 
Type 'copyright', 'credits' or 'license' for more information
IPython 7.18.1 -- An enhanced Interactive Python. Type '?' for help.

In [1]: import dd
                  ddcmd 
                  ddrepl
</pre>

<p>
Here, in a poor, uncolored ASCII facsimile, shows some of the nice REPL
features that <code>ptipython</code> provides.  The last two lines are a drop-down
menu of modules matching an initial <code>dd</code> typing.  <code>Ctrl-n</code> to highlight
<code>ddcmd</code> and <code>Enter</code> to select.
</p>

<div class="tip">
<p>
This document is made in Emacs orgmode using <code>ob-ipython</code>.  It may be reproduced after also running: <code>pip install ipython jupyter</code> and editing <code>ddcmd.org</code> from an instance of <code>emacs</code> started from the Python environment.
</p>

</div>
</div>
</div>

<div id="outline-container-orgf93c208" class="outline-2">
<h2 id="orgf93c208">Quick Start</h2>
<div class="outline-text-2" id="text-orgf93c208">
<p>
This section shows how to create one particular sequence of command
objects while leaving aside any explanation.  The remainder of the
document will fill in the background information.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #b4fa70;">import</span> moo
<span style="color: #b4fa70;">import</span> ddcmd

<span style="color: #b4fa70;">for</span> mod <span style="color: #b4fa70;">in</span> [<span style="color: #e9b96e;">"cmd"</span>, <span style="color: #e9b96e;">"FakeDataProducerDAQModule"</span>, <span style="color: #e9b96e;">"FakeDataConsumerDAQModule"</span>]:
    moo.otypes.load_types(f<span style="color: #e9b96e;">"appfwk-{mod}-schema.jsonnet"</span>)

<span style="color: #b4fa70;">from</span> dunedaq.appfwk <span style="color: #b4fa70;">import</span> cmd
<span style="color: #b4fa70;">from</span> dunedaq.appfwk <span style="color: #b4fa70;">import</span> fakedataproducerdaqmodule <span style="color: #b4fa70;">as</span> fdp
<span style="color: #b4fa70;">from</span> dunedaq.appfwk <span style="color: #b4fa70;">import</span> fakedataconsumerdaqmodule <span style="color: #b4fa70;">as</span> fdc

<span style="color: #fcaf3e;">queues</span> = cmd.QueueSpecs([
  cmd.QueueSpec(kind=<span style="color: #e9b96e;">'StdDeQueue'</span>, inst=<span style="color: #e9b96e;">"hose"</span>, capacity=10)])
<span style="color: #fcaf3e;">modules</span> = cmd.ModSpecs([
  cmd.ModSpec(inst=<span style="color: #e9b96e;">"source"</span>, plugin=<span style="color: #e9b96e;">"FakeDataProducerDAQModule"</span>,
    data=cmd.QueueInfo(inst=<span style="color: #e9b96e;">"hose"</span>, name=<span style="color: #e9b96e;">"output"</span>, <span style="color: #e090d7;">dir</span>=<span style="color: #e9b96e;">"output"</span>)),
  cmd.ModSpec(inst=<span style="color: #e9b96e;">"sink"</span>, plugin=<span style="color: #e9b96e;">"FakeDataConsumerDAQModule"</span>,
    data=cmd.QueueInfo(inst=<span style="color: #e9b96e;">"host"</span>, name=<span style="color: #e9b96e;">"input"</span>, <span style="color: #e090d7;">dir</span>=<span style="color: #e9b96e;">"input"</span>))])
<span style="color: #fcaf3e;">myinit</span> = ddcmd.init(queues=queues, modules=modules)

<span style="color: #fcaf3e;">myconf</span> = ddcmd.conf([
  cmd.AddressedCmd(match=<span style="color: #e9b96e;">"source"</span>, data=fdp.Conf()),
  cmd.AddressedCmd(match=<span style="color: #e9b96e;">"sink"</span>, data=fdc.Conf())])

[myinit, myconf]
</pre>
</div>

<pre class="example">
[&lt;record Command, fields: {id, data}&gt;, &lt;record Command, fields: {id, data}&gt;]
</pre>

<p>
This produces two command objects, one to initialize and one to
configure.  These can be fed to the <code>appfwk</code> app <code>daq_application</code>.  Other
commands exist (eg, <code>start</code> and <code>stop</code>).
</p>

<p>
Read on for explanation on what this quick start is doing and how to
learn to use the Python types to make your own command objects.
</p>
</div>
</div>
