ddcmd.org
* Loading types
 
To get Python types with which we may construct objects we first load
a schema:

#+begin_src ipython :session :exports both :results raw drawer
import ddcmd
schema = ddcmd.load_oschema("appfwk-cmd-schema.jsonnet")
types = ddcmd.make_otypes(schema)
types
#+end_src

#+RESULTS:
:results:
# Out[3]:
#+BEGIN_EXAMPLE
  {'dunedaq.appfwk.cmd.Match': dunedaq.appfwk.cmd.Match,
  'dunedaq.appfwk.cmd.Data': dunedaq.appfwk.cmd.Data,
  'dunedaq.appfwk.cmd.AddressedCmd': dunedaq.appfwk.cmd.AddressedCmd,
  'dunedaq.appfwk.cmd.AddressedCmds': dunedaq.appfwk.cmd.AddressedCmds,
  'dunedaq.appfwk.cmd.CmdId': dunedaq.appfwk.cmd.CmdId,
  'dunedaq.appfwk.cmd.CmdObj': dunedaq.appfwk.cmd.CmdObj,
  'dunedaq.appfwk.cmd.Command': dunedaq.appfwk.cmd.Command,
  'dunedaq.appfwk.cmd.QueueKind': dunedaq.appfwk.cmd.QueueKind,
  'dunedaq.appfwk.cmd.InstName': dunedaq.appfwk.cmd.InstName,
  'dunedaq.appfwk.cmd.QueueCapacity': dunedaq.appfwk.cmd.QueueCapacity,
  'dunedaq.appfwk.cmd.QueueSpec': dunedaq.appfwk.cmd.QueueSpec,
  'dunedaq.appfwk.cmd.QueueSpecs': dunedaq.appfwk.cmd.QueueSpecs,
  'dunedaq.appfwk.cmd.PluginName': dunedaq.appfwk.cmd.PluginName,
  'dunedaq.appfwk.cmd.ModSpec': dunedaq.appfwk.cmd.ModSpec,
  'dunedaq.appfwk.cmd.ModSpecs': dunedaq.appfwk.cmd.ModSpecs,
  'dunedaq.appfwk.cmd.Init': dunedaq.appfwk.cmd.Init,
  'dunedaq.appfwk.cmd.Label': dunedaq.appfwk.cmd.Label,
  'dunedaq.appfwk.cmd.QueueDir': dunedaq.appfwk.cmd.QueueDir,
  'dunedaq.appfwk.cmd.QueueInfo': dunedaq.appfwk.cmd.QueueInfo,
  'dunedaq.appfwk.cmd.QueueInfos': dunedaq.appfwk.cmd.QueueInfos,
  'dunedaq.appfwk.cmd.ModInit': dunedaq.appfwk.cmd.ModInit}
#+END_EXAMPLE
:end:

The ~schema~ variable holds a data structure representing a ~moo~
"oschema" (object schema) which is then turned into a set of Python
types by the ~make_otypes()~ function.  It happens to return a
dictionary mapping fully-qualified type name to type (~class~) and these
types are also made into first-class Python types in a module
hierarchy.

* Interrogating types 

As an example, let's look at one of the most trivial types in the
~appfwk~ schema, a ~CmdId~.

#+begin_warning
The ~CmdId~ is meant to name a command type.  It currently allows a
fairly free string.  At some point it may allow to take one of an
enumerated list.
#+end_warning

First, we import the Python namespace holding all our types and make
an instance of ~CmdId~.  We'll see how we know what we had to provide
next.

#+begin_src ipython :session :exports both :results raw drawer
from dunedaq.appfwk import cmd
cid = cmd.CmdId("init")
(cid, cid.pod())
#+end_src

#+RESULTS:
:results:
# Out[17]:
: (<string CmdId: init>, 'init')
:end:

We can see the representation of the instance of a ~CmdId~ shows us:

- the oschema "class" is /string/
- the type of /string/ is ~CmdId~
- the value held by the instance is ~init~

And, the value itself can be pulled out as Plain Old Data (POD) via
the ~.pod()~ method.  Instances of all "otypes" have this method.

In ~ptipython~ (and ~ipython~) we may query the Python class representing
the type for hints on how to use it.  For example, here is what
~ptipython~ shows for ~cmd.CmdId?~

#+begin_example
In [11]: cmd.CmdId?
Init signature: cmd.CmdId(val)
Docstring:     
String type CmdId.
- pattern: ^[a-zA-Z][a-zA-Z0-9_]*$
- format: None
The command name.  FIXME: this should be an enum!
#+end_example

The documentation talks about a ~pattern~ and a ~format~ which are
relevant for types of the schema class /string/.  If provided, these
constraints are applied when we try to either construct or ~update()~ an
instance of the /string/ schema class type.  Let's try to violate the
~pattern~ constraint:

#+begin_example
cid.update("very bad")
...
ValidationError: 'very bad' does not match '^[a-zA-Z][a-zA-Z0-9_]*$'
...
ValueError: format mismatch for string CmdId
#+end_example

#+begin_note
Typically, a ~ValueError~ will be raised if a constraint is violated.
In the case of ~string~ schema class types, you may also see
intermediate ~ValidationErrors~ which come from the JSON Schema
validation code that does the heavy lifting.
#+end_note

* Examples

Here we go through some examples of making instances of types of
different schema classes.  We saw /string/ above so will skip it.

** Boolean

The simplest schema class is /boolean/.  The ~appfwk~ schema currently
includes no examples.  We can however, create one from whole cloth by
dropping down to ~moo~.

#+begin_src ipython :session :exports both :results raw drawer
  import moo
  moo.otypes.make_type(schema="boolean", name="MyBool", doc="Example Boolean", path="test.junk")
  from test.junk import MyBool
  MyBool(True)
#+end_src

#+RESULTS:
:results:
# Out[20]:
: <boolean MyBool: True>
:end:

And, let the REPL show some docs:

#+begin_example
In [17]: MyBool?
Init signature: MyBool(val)
Docstring:     
A MyBool boolean
Example Boolean
#+end_example

#+begin_tip
With ~moo~ /boolean/ types we may set them to various "truthy" and "falsie" values.  For example the POD string ~"yes"~ will register as ~True~.
#+end_tip

** Numbers

Every type of ~appfwk~ queue has a "capacity" which we will provide from
instances of the type ~QueueCapacity~ which is of the schema class
/number/.

#+begin_example
In [12]: cmd.QueueCapacity?
Init signature: cmd.QueueCapacity(val)
Docstring:      A number type QueueCapacity
#+end_example

#+begin_warning
While the ~moo~ schema class /number/ supports defining constraints, more
work is needed for their actual implementation both at the
representation level and in the generated Python "otypes".
#+end_warning

** Strings

We saw an example of a /string/ schema class type ~CmdId~ above in the
section [[Interrogating types]] so we will not repeat that here.


** Enums

An /enum/ is a string-like type that may take on a value from a predetermined set.  The defining schema may specify a default value from this set or if not given then the first value is taken as default.

The ~appfwk~ schema uses an /enum/ type ~QueueKind~ to identity a "kind"
of queue.  It's documentation:

#+begin_example
In [21]: cmd.QueueKind?
Init signature: cmd.QueueKind(val=None)
Docstring:     
Enum type QueueKind [['Unknown', 'StdDeQueue', 'FollySPSCQueue', 'FollyMPMCQueue']]
The kinds (types/classes) of queues
#+end_example

We can see the default value in action with a default construction:

#+begin_src ipython :session :exports both :results raw drawer
cmd.QueueKind()
#+end_src

#+RESULTS:
:results:
# Out[77]:
: <enum QueueKind: 'Unknown' of ['Unknown', 'StdDeQueue', 'FollySPSCQueue', 'FollyMPMCQueue']>
:end:

Let's try to break it:

#+begin_example
In [25]: cmd.QueueKind("MagicQueue")
...
ValueError: illegal enum QueueKind value MagicQueue
#+end_example

