ddcmd.html

<div id="outline-container-org623bc40" class="outline-2">
<h2 id="org623bc40">Loading types</h2>
<div class="outline-text-2" id="text-org623bc40">
<p>
To get Python types with which we may construct objects we first load
a schema:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #b4fa70;">import</span> moo
<span style="color: #fcaf3e;">types</span> = moo.otypes.load_types(<span style="color: #e9b96e;">"appfwk-cmd-schema.jsonnet"</span>)
types
</pre>
</div>

<pre class="example">
{'dunedaq.appfwk.cmd.Match': dunedaq.appfwk.cmd.Match,
'dunedaq.appfwk.cmd.Data': dunedaq.appfwk.cmd.Data,
'dunedaq.appfwk.cmd.AddressedCmd': dunedaq.appfwk.cmd.AddressedCmd,
'dunedaq.appfwk.cmd.AddressedCmds': dunedaq.appfwk.cmd.AddressedCmds,
'dunedaq.appfwk.cmd.CmdId': dunedaq.appfwk.cmd.CmdId,
'dunedaq.appfwk.cmd.CmdObj': dunedaq.appfwk.cmd.CmdObj,
'dunedaq.appfwk.cmd.Command': dunedaq.appfwk.cmd.Command,
'dunedaq.appfwk.cmd.QueueKind': dunedaq.appfwk.cmd.QueueKind,
'dunedaq.appfwk.cmd.InstName': dunedaq.appfwk.cmd.InstName,
'dunedaq.appfwk.cmd.QueueCapacity': dunedaq.appfwk.cmd.QueueCapacity,
'dunedaq.appfwk.cmd.QueueSpec': dunedaq.appfwk.cmd.QueueSpec,
'dunedaq.appfwk.cmd.QueueSpecs': dunedaq.appfwk.cmd.QueueSpecs,
'dunedaq.appfwk.cmd.PluginName': dunedaq.appfwk.cmd.PluginName,
'dunedaq.appfwk.cmd.ModSpec': dunedaq.appfwk.cmd.ModSpec,
'dunedaq.appfwk.cmd.ModSpecs': dunedaq.appfwk.cmd.ModSpecs,
'dunedaq.appfwk.cmd.Init': dunedaq.appfwk.cmd.Init,
'dunedaq.appfwk.cmd.Label': dunedaq.appfwk.cmd.Label,
'dunedaq.appfwk.cmd.QueueDir': dunedaq.appfwk.cmd.QueueDir,
'dunedaq.appfwk.cmd.QueueInfo': dunedaq.appfwk.cmd.QueueInfo,
'dunedaq.appfwk.cmd.QueueInfos': dunedaq.appfwk.cmd.QueueInfos,
'dunedaq.appfwk.cmd.ModInit': dunedaq.appfwk.cmd.ModInit}
</pre>

<p>
The <code>schema</code> variable holds a data structure representing a <code>moo</code>
"oschema" (object schema) which is then turned into a set of Python
types by the <code>make_otypes()</code> function.  It happens to return a
dictionary mapping fully-qualified type name to type (<code>class</code>) and these
types are also made into first-class Python types in a module
hierarchy.
</p>
</div>
</div>

<div id="outline-container-org1d861d8" class="outline-2">
<h2 id="org1d861d8">Interrogating types</h2>
<div class="outline-text-2" id="text-org1d861d8">
<p>
As an example, let's look at one of the most trivial types in the
<code>appfwk</code> schema, a <code>CmdId</code>.
</p>

<div class="warning">
<p>
The <code>CmdId</code> is meant to name a command type.  It currently allows a
fairly free string.  At some point it may allow to take one of an
enumerated list.
</p>

</div>

<p>
First, we import the Python namespace holding all our types and make
an instance of <code>CmdId</code>.  We'll see how we know what we had to provide
next.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #b4fa70;">from</span> dunedaq.appfwk <span style="color: #b4fa70;">import</span> cmd
<span style="color: #fcaf3e;">cid</span> = cmd.CmdId(<span style="color: #e9b96e;">"init"</span>)
(cid, cid.pod())
</pre>
</div>

<pre class="example">
(&lt;string CmdId: init&gt;, 'init')
</pre>

<p>
We can see the representation of the instance of a <code>CmdId</code> shows us:
</p>

<ul class="org-ul">
<li>the oschema "class" is <i>string</i></li>
<li>the type of <i>string</i> is <code>CmdId</code></li>
<li>the value held by the instance is <code>init</code></li>
</ul>

<p>
And, the value itself can be pulled out as Plain Old Data (POD) via
the <code>.pod()</code> method.  Instances of all "otypes" have this method.
</p>

<p>
In <code>ptipython</code> (and <code>ipython</code>) we may query the Python class representing
the type for hints on how to use it.  For example, here is what
<code>ptipython</code> shows for <code>cmd.CmdId?</code>
</p>

<pre class="example">
In [11]: cmd.CmdId?
Init signature: cmd.CmdId(val)
Docstring:     
String type CmdId.
- pattern: ^[a-zA-Z][a-zA-Z0-9_]*$
- format: None
The command name.  FIXME: this should be an enum!
</pre>

<p>
The documentation talks about a <code>pattern</code> and a <code>format</code> which are
relevant for types of the schema class <i>string</i>.  If provided, these
constraints are applied when we try to either construct or <code>update()</code> an
instance of the <i>string</i> schema class type.  Let's try to violate the
<code>pattern</code> constraint:
</p>

<pre class="example">
cid.update("very bad")
...
ValidationError: 'very bad' does not match '^[a-zA-Z][a-zA-Z0-9_]*$'
...
ValueError: format mismatch for string CmdId
</pre>

<div class="note">
<p>
Typically, a <code>ValueError</code> will be raised if a constraint is violated.
In the case of <code>string</code> schema class types, you may also see
intermediate <code>ValidationErrors</code> which come from the JSON Schema
validation code that does the heavy lifting.
</p>

</div>
</div>
</div>

<div id="outline-container-org113e009" class="outline-2">
<h2 id="org113e009">Examples</h2>
<div class="outline-text-2" id="text-org113e009">
<p>
Here we go through some examples of making instances of types of
different schema classes.  We saw <i>string</i> above so will skip it.
</p>
</div>

<div id="outline-container-orgb09464f" class="outline-3">
<h3 id="orgb09464f">Boolean</h3>
<div class="outline-text-3" id="text-orgb09464f">
<p>
The simplest schema class is <i>boolean</i>.  The <code>appfwk</code> schema currently
includes no examples.  We can however, create one from whole cloth by
dropping down to <code>moo</code>.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #b4fa70;">import</span> moo
moo.otypes.make_type(schema=<span style="color: #e9b96e;">"boolean"</span>, name=<span style="color: #e9b96e;">"MyBool"</span>, doc=<span style="color: #e9b96e;">"Example Boolean"</span>, path=<span style="color: #e9b96e;">"test.junk"</span>)
<span style="color: #b4fa70;">from</span> test.junk <span style="color: #b4fa70;">import</span> MyBool
MyBool(<span style="color: #e9b2e3;">True</span>)
</pre>
</div>

<pre class="example">
&lt;boolean MyBool: True&gt;
</pre>

<p>
And, let the REPL show some docs:
</p>

<pre class="example">
In [17]: MyBool?
Init signature: MyBool(val)
Docstring:     
A MyBool boolean
Example Boolean
</pre>

<div class="tip">
<p>
With <code>moo</code> <i>boolean</i> types we may set them to various "truthy" and "falsie" values.  For example the POD string <code>"yes"</code> will register as <code>True</code>.
</p>

</div>
</div>
</div>

<div id="outline-container-orga26d941" class="outline-3">
<h3 id="orga26d941">Numbers</h3>
<div class="outline-text-3" id="text-orga26d941">
<p>
Every type of <code>appfwk</code> queue has a "capacity" which we will provide from
instances of the type <code>QueueCapacity</code> which is of the schema class
<i>number</i>.
</p>

<pre class="example">
In [12]: cmd.QueueCapacity?
Init signature: cmd.QueueCapacity(val)
Docstring:      A number type QueueCapacity
</pre>

<div class="warning">
<p>
While the <code>moo</code> schema class <i>number</i> supports defining constraints, more
work is needed for their actual implementation both at the
representation level and in the generated Python "otypes".
</p>

</div>
</div>
</div>

<div id="outline-container-org4e27dec" class="outline-3">
<h3 id="org4e27dec">Strings</h3>
<div class="outline-text-3" id="text-org4e27dec">
<p>
We saw an example of a <i>string</i> schema class type <code>CmdId</code> above in the
section <a href="#org1d861d8">Interrogating types</a> so we will not repeat that here.
</p>
</div>
</div>


<div id="outline-container-org0f0bc95" class="outline-3">
<h3 id="org0f0bc95">Enums</h3>
<div class="outline-text-3" id="text-org0f0bc95">
<p>
An <i>enum</i> is a string-like type that may take on a value from a predetermined set.  The defining schema may specify a default value from this set or if not given then the first value is taken as default.
</p>

<p>
The <code>appfwk</code> schema uses an <i>enum</i> type <code>QueueKind</code> to identity a "kind"
of queue.  It's documentation:
</p>

<pre class="example">
In [21]: cmd.QueueKind?
Init signature: cmd.QueueKind(val=None)
Docstring:     
Enum type QueueKind [['Unknown', 'StdDeQueue', 'FollySPSCQueue', 'FollyMPMCQueue']]
The kinds (types/classes) of queues
</pre>

<p>
We can see the default value in action with a default construction:
</p>

<div class="org-src-container">
<pre class="src src-ipython">cmd.QueueKind()
</pre>
</div>

<pre class="example">
&lt;enum QueueKind: 'Unknown' of ['Unknown', 'StdDeQueue', 'FollySPSCQueue', 'FollyMPMCQueue']&gt;
</pre>

<p>
Let's try to break it:
</p>

<pre class="example">
In [25]: cmd.QueueKind("MagicQueue")
...
ValueError: illegal enum QueueKind value MagicQueue
</pre>
</div>
</div>
