ddcmd.org
** Records

The Python type which corresponds to a ~moo~ oschema class /record/ has
some extra functionality to allow instances to mimic Python data
objects while assuring type constraints.

One simple record in the ~appfwk~ command schema is ~QueueSpec~.  Let's
let the REPL tell us about it:

#+begin_example
In [19]: cmd.QueueSpec?
Init signature:
cmd.QueueSpec(
    *args,
    kind: dunedaq.appfwk.cmd.QueueKind = 'Unknown',
    inst: dunedaq.appfwk.cmd.InstName = None,
    capacity: dunedaq.appfwk.cmd.QueueCapacity = None,
)
Docstring:     
Record type QueueSpec with fields: "kind", "inst", "capacity"

Queue specification
#+end_example

We see that ~kind~ is a ~QueueKind~, introduced previously, and that the
default value for this /enum/ has been forwarded to be a default value
for the field.  This is a special handling for /enum/ fields.  The
schema could have set a field default different than the /enum/ default.

The ~appfwk~ schema happens to not provide defaults for the other two
fields: ~inst~ of a /string/ type ~InstName~ and ~capacity~ a /number/ type and
also introduced previously.  We must provide at least these latter two
at some point to have a fully constructed instance of the type
~QueueSpec~.  Let's start by making an instance with just the ~capacity~
/record/ field given.

#+begin_src ipython :session :exports both :results raw drawer
qs = cmd.QueueSpec(capacity=10)
(qs, qs.kind, qs.capacity)
#+end_src

#+RESULTS:
:results:
# Out[26]:
: (<record QueueSpec, fields: {kind, inst, capacity}>, 'Unknown', 10)
:end:

#+begin_note
Accessing an attribute of an instance of a /record/ type results in POD.
Likewise, one may use POD to set an attribute as long as the value is
consistent with the associated field type.  One may also provide an
instance of a consistent schema class type in setting an attribute.
#+end_note

If we try to get the ~qs.inst~ attribute or call ~qs.pod()~ (which will
try to access all required attributes) at this time we will get an
error as the record is not yet complete.

#+begin_example
print(qs.inst)
...
AttributeError: no such attribute inst
#+end_example

Let's set that last attribute now:

#+begin_src ipython :session :exports both :results raw drawer
qs.inst = "hose"
qs.pod()
#+end_src

#+RESULTS:
:results:
# Out[29]:
: {'kind': 'Unknown', 'inst': 'hose', 'capacity': 10}
:end:

Records follow [[https://en.wikipedia.org/wiki/Robustness_principle][Postel's law]] by being "generous in what they accept and
strict in what they produce".  This allows us to delay filling in all
the required fields and relying on defaults where desired.  As we saw,
strictness comes in when accessing the values of the /record/ type
instance.

However, when explicitly setting a value, the /record/ type instance will
be strict so that no "illegal" values will be accepted.  The type
~InstName~ can not be just any string but must be short identifier such
as might be a valid variable name in a C-like syntax.  Let's try to
break it:

#+begin_example
In [30]: qs.inst = "very wrong"
...
ValidationError: 'very wrong' does not match '^[a-zA-Z][a-zA-Z0-9_]*$'
...
ValueError: format mismatch for string InstName
#+end_example

Like with the /string/ example above, setting the field of a /record/
which is itself a string needs to be done properly.

** Sequences

A /sequence/ schema class models an ordered array or list of elements
which are themselves each of the same type.  The ~appfwk~ schema has a
type called ~QueueSpecs~ which, as the pluralized name implies, is a
/sequence/ of /record/ type ~QueueSpec~ which we learned above.  Our REPL
tells us:

#+begin_example
In [31]: cmd.QueueSpecs?
Init signature: cmd.QueueSpecs(val)
Docstring:     
A QueueSpecs sequence holding type dunedaq.appfwk.cmd.QueueSpec.
A sequence of QueueSpec
#+end_example

Let's make one with as single item of type ~QueueSpec~.

#+begin_src ipython :session :exports both :results raw drawer
qs = cmd.QueueSpec(capacity=10, inst="hose")
qss = cmd.QueueSpecs([qs])
(qss, qss.pod())
#+end_src

#+RESULTS:
:results:
# Out[55]:
#+BEGIN_EXAMPLE
  (<sequence QueueSpecs 1:[dunedaq.appfwk.cmd.QueueSpec]>,
  [{'kind': 'Unknown', 'inst': 'hose', 'capacity': 10}])
#+END_EXAMPLE
:end:

A /sequence/ type instance may be empty:

#+begin_src ipython :session :exports both :results raw drawer
qss = cmd.QueueSpecs([])
(qss, qss.pod())
#+end_src

#+RESULTS:
:results:
# Out[58]:
: (<sequence QueueSpecs 0:[dunedaq.appfwk.cmd.QueueSpec]>, [])
:end:

And, later updated:

#+begin_src ipython :session :exports both :results raw drawer
qss.update([qs])
(qss, qss.pod())
#+end_src

#+RESULTS:
:results:
# Out[57]:
#+BEGIN_EXAMPLE
  (<sequence QueueSpecs 1:[dunedaq.appfwk.cmd.QueueSpec]>,
  [{'kind': 'Unknown', 'inst': 'hose', 'capacity': 10}])
#+END_EXAMPLE
:end:

#+begin_warning
Some changes may still be made to /sequence/ schema class such as setting constraints on the size of the sequence.  The Python /sequence/ types may also be modified to allow ~list~-like mutation operations such as ~append()~.  For now, a /sequence/ type in Python treats its data as atomic.
#+end_warning

