ddcmd.html

<div id="outline-container-orga995aed" class="outline-3">
<h3 id="orga995aed">Records</h3>
<div class="outline-text-3" id="text-orga995aed">
<p>
The Python type which corresponds to a <code>moo</code> oschema class <i>record</i> has
some extra functionality to allow instances to mimic Python data
objects while assuring type constraints.
</p>

<p>
One simple record in the <code>appfwk</code> command schema is <code>QueueSpec</code>.  Let's
let the REPL tell us about it:
</p>

<pre class="example">
In [19]: cmd.QueueSpec?
Init signature:
cmd.QueueSpec(
    *args,
    kind: dunedaq.appfwk.cmd.QueueKind = 'Unknown',
    inst: dunedaq.appfwk.cmd.InstName = None,
    capacity: dunedaq.appfwk.cmd.QueueCapacity = None,
)
Docstring:     
Record type QueueSpec with fields: "kind", "inst", "capacity"

Queue specification
</pre>

<p>
We see that <code>kind</code> is a <code>QueueKind</code>, introduced previously, and that the
default value for this <i>enum</i> has been forwarded to be a default value
for the field.  This is a special handling for <i>enum</i> fields.  The
schema could have set a field default different than the <i>enum</i> default.
</p>

<p>
The <code>appfwk</code> schema happens to not provide defaults for the other two
fields: <code>inst</code> of a <i>string</i> type <code>InstName</code> and <code>capacity</code> a <i>number</i> type and
also introduced previously.  We must provide at least these latter two
at some point to have a fully constructed instance of the type
<code>QueueSpec</code>.  Let's start by making an instance with just the <code>capacity</code>
<i>record</i> field given.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fcaf3e;">qs</span> = cmd.QueueSpec(capacity=10)
(qs, qs.kind, qs.capacity)
</pre>
</div>

<pre class="example">
(&lt;record QueueSpec, fields: {kind, inst, capacity}&gt;, 'Unknown', 10)
</pre>

<div class="note">
<p>
Accessing an attribute of an instance of a <i>record</i> type results in POD.
Likewise, one may use POD to set an attribute as long as the value is
consistent with the associated field type.  One may also provide an
instance of a consistent schema class type in setting an attribute.
</p>

</div>

<p>
If we try to get the <code>qs.inst</code> attribute or call <code>qs.pod()</code> (which will
try to access all required attributes) at this time we will get an
error as the record is not yet complete.
</p>

<pre class="example">
print(qs.inst)
...
AttributeError: no such attribute inst
</pre>

<p>
Let's set that last attribute now:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fcaf3e;">qs.inst</span> = <span style="color: #e9b96e;">"hose"</span>
qs.pod()
</pre>
</div>

<pre class="example">
{'kind': 'Unknown', 'inst': 'hose', 'capacity': 10}
</pre>

<p>
Records follow <a href="https://en.wikipedia.org/wiki/Robustness_principle">Postel's law</a> by being "generous in what they accept and
strict in what they produce".  This allows us to delay filling in all
the required fields and relying on defaults where desired.  As we saw,
strictness comes in when accessing the values of the <i>record</i> type
instance.
</p>

<p>
However, when explicitly setting a value, the <i>record</i> type instance will
be strict so that no "illegal" values will be accepted.  The type
<code>InstName</code> can not be just any string but must be short identifier such
as might be a valid variable name in a C-like syntax.  Let's try to
break it:
</p>

<pre class="example">
In [30]: qs.inst = "very wrong"
...
ValidationError: 'very wrong' does not match '^[a-zA-Z][a-zA-Z0-9_]*$'
...
ValueError: format mismatch for string InstName
</pre>

<p>
Like with the <i>string</i> example above, setting the field of a <i>record</i>
which is itself a string needs to be done properly.
</p>
</div>
</div>

<div id="outline-container-org7d9f328" class="outline-3">
<h3 id="org7d9f328">Sequences</h3>
<div class="outline-text-3" id="text-org7d9f328">
<p>
A <i>sequence</i> schema class models an ordered array or list of elements
which are themselves each of the same type.  The <code>appfwk</code> schema has a
type called <code>QueueSpecs</code> which, as the pluralized name implies, is a
<i>sequence</i> of <i>record</i> type <code>QueueSpec</code> which we learned above.  Our REPL
tells us:
</p>

<pre class="example">
In [31]: cmd.QueueSpecs?
Init signature: cmd.QueueSpecs(val)
Docstring:     
A QueueSpecs sequence holding type dunedaq.appfwk.cmd.QueueSpec.
A sequence of QueueSpec
</pre>

<p>
Let's make one with as single item of type <code>QueueSpec</code>.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fcaf3e;">qs</span> = cmd.QueueSpec(capacity=10, inst=<span style="color: #e9b96e;">"hose"</span>)
<span style="color: #fcaf3e;">qss</span> = cmd.QueueSpecs([qs])
(qss, qss.pod())
</pre>
</div>

<pre class="example">
(&lt;sequence QueueSpecs 1:[dunedaq.appfwk.cmd.QueueSpec]&gt;,
[{'kind': 'Unknown', 'inst': 'hose', 'capacity': 10}])
</pre>

<p>
A <i>sequence</i> type instance may be empty:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fcaf3e;">qss</span> = cmd.QueueSpecs([])
(qss, qss.pod())
</pre>
</div>

<pre class="example">
(&lt;sequence QueueSpecs 0:[dunedaq.appfwk.cmd.QueueSpec]&gt;, [])
</pre>

<p>
And, later updated:
</p>

<div class="org-src-container">
<pre class="src src-ipython">qss.update([qs])
(qss, qss.pod())
</pre>
</div>

<pre class="example">
(&lt;sequence QueueSpecs 1:[dunedaq.appfwk.cmd.QueueSpec]&gt;,
[{'kind': 'Unknown', 'inst': 'hose', 'capacity': 10}])
</pre>

<div class="warning">
<p>
Some changes may still be made to <i>sequence</i> schema class such as setting constraints on the size of the sequence.  The Python <i>sequence</i> types may also be modified to allow <code>list</code>-like mutation operations such as <code>append()</code>.  For now, a <i>sequence</i> type in Python treats its data as atomic.
</p>

</div>
</div>
</div>
