ddcmd.org
** Anys 

An /any/ type is a simple form of a dynamic type.  It is *kind of* like a
~void*~ in C or a pointer to a polymorphic base class in C++ but there
is a twist.  Two different /any/ types are not compatible.  That is, an
instance of /any/ type ~Data1~ can not be used to construct or update an
instance of /any/ type ~Data2~.

Another twist is that an instance of an /any/ type may only be
constructed or updated with any other non-/any/ "otype" (or an instance
of the same /any/ type) but not any POD.  Despite that, an instance of
an /any/ type can still be turned into POD with the usual ~.pod()~ method.

#+begin_note
An /any/ type is used in a few places in the ~appfwk~ command schema
because the internals of ~appfwk~ require layers of [[https://en.wikipedia.org/wiki/Type_erasure][type erasure]] so that
different types of commands and of modules can be accommodated while
retaining a generalized schema.  Without /any/ wholly new schema would
have to be developed for every possible command type and every
possible combination of module implementations.
#+end_note

In the ~appfwk~ schema, we currently have one catch-all /any/ type called ~Data~.

#+begin_warning
The current version of ~appfwk~ schema uses a *single* /any/ type called
~Data~ for *every* point of type erasure.  Future versions of the schema
may define multiple /any/ types in order to differentiate the different
semantics.  For example, to differentiate ~Command.data~ from ~Init.data~.
#+end_warning

#+begin_example
In [7]: cmd.Data?
Init signature: cmd.Data(val)
Docstring:     
The any type Data.

Can hold any oschema type except Any types that are not Data.

An opaque object holding lower layer substructure
#+end_example

As above, we must use *some* schema type instance to set an /any/ type
instance.  Here we use ~CmdId~ for simplicity.  In a "real" command
object, the /any/ type Data tends to hold some larger /record/ type.

#+begin_src ipython :session :exports both :results raw drawer
d1 = cmd.Data(cmd.CmdId("conf"))
d1.update(cmd.QueueKind("StdDeQueue"))
d1.pod()
#+end_src

#+RESULTS:
:results:
# Out[24]:
: 'StdDeQueue'
:end:

Let's try to break it:

#+begin_example
In [23]: d2 = cmd.Data("this should not work")
...
ValueError: any type Data requires oschema type

In [25]: moo.otypes.make_type(schema="any", name="Other", doc="Another any", path="test.junk")
In [26]: from test.junk import Other
In [28]: d3 = Other(d1)
...
ValueError: cross any updates not allowed
#+end_example

* Construct Commands

The schema corresponding to the ~appfwk~ commands with IDs ~init~ and ~conf~
are simple but take some work to construct.  Besides setting values
which reside in fixed structure, their layers of type erasure (/any/
types) allow for whole substructure to be provided in a parameterized
manner.  We'll go through these two command objects separately.

Regardless of the type of command object, the top level structure is
provided by a simple schema with an ID and an /any/:

#+begin_example
In [29]: cmd.Command?
Init signature:
cmd.Command(
    *args,
    id: dunedaq.appfwk.cmd.CmdId = None,
    data: dunedaq.appfwk.cmd.Data = None,
)
Docstring:     
Record type Command with fields: "id", "data"

Top-level command object structure
#+end_example

The ~data~ field should be populated with a subobject of a type that
depends on the value of ~id~.

** The ~init~ command

The ~init~ command provides all the information to take a fully *generic*
~appfwk~ application into one that has all of its queues and modules
constructed.  The queues are also fully configured by this ~init~
command.  The modules receive notice of the ~init~ and may even require
custom ~init~ information but such is best left for ~conf~.

The substructure for ~Command.data~ for an ~init~ command is a:

#+begin_example
In [30]: cmd.Init?
Init signature:
cmd.Init(
    *args,
    queues: dunedaq.appfwk.cmd.QueueSpecs = None,
    modules: dunedaq.appfwk.cmd.ModSpecs = None,
)
Docstring:     
Record type Init with fields: "queues", "modules"

The app-level init command data object struction
#+end_example

The ~ModSpecs~ are new:

#+begin_example
In [32]: cmd.ModSpec?
Init signature:
cmd.ModSpec(
    *args,
    plugin: dunedaq.appfwk.cmd.PluginName = None,
    inst: dunedaq.appfwk.cmd.InstName = None,
    data: dunedaq.appfwk.cmd.Data = None,
)
Docstring:     
Record type ModSpec with fields: "plugin", "inst", "data"

Module specification
#+end_example

#+begin_note
The /any/ ~Data~ type is seen again here.  It is used, in principle, to
inject a module implementation specific object.  This is a "just in
case" feature.  Most modules should get their custom information as
part of their ~conf~ command object.
#+end_note

The simplest, and most boring, ~init~ command:

#+begin_src ipython :session :exports both :results raw drawer
myinit = cmd.Command(id=cmd.CmdId("init"), data=cmd.Init(queues=[], modules=[]))
myinit.pod()
#+end_src

#+RESULTS:
:results:
# Out[121]:
: {'id': 'init', 'data': {'queues': [], 'modules': []}}
:end:

That code has some redundancies so we can replace it with a little helper:

#+begin_src ipython :session :exports both :results raw drawer
import ddcmd
myinit = ddcmd.init()
myinit.pod()
#+end_src

#+RESULTS:
:results:
# Out[124]:
: {'id': 'init', 'data': {'queues': [], 'modules': []}}
:end:

As such, this ~init~ command would initialize an "empty" and rather
useless app instance.  The next two sections describe how to make the
queue and module sequences with a working example.

*** Queue initialization

An ~appfwk~ queue is initialized with a ~QueueSpec~ which we introduced
already.  The only new thing to know is that a queue ~inst~ field
(instance name) must used be also in *two* places in the module init
objects.  That is, one or two modules need to know the queue name in
order to attach to its two endpoints.  

Keeping things simple, we make just one queue named ~"host"~:

#+begin_src ipython :session :exports both :results raw drawer
queues = cmd.QueueSpecs([
  cmd.QueueSpec(kind='StdDeQueue', inst="hose", capacity=10)])
queues.pod()
#+end_src

#+RESULTS:
:results:
# Out[129]:
: [{'kind': 'StdDeQueue', 'inst': 'hose', 'capacity': 10}]
:end:

