ddcmd.html

<div id="outline-container-orgf2e0a50" class="outline-3">
<h3 id="orgf2e0a50">Anys</h3>
<div class="outline-text-3" id="text-orgf2e0a50">
<p>
An <i>any</i> type is a simple form of a dynamic type.  It is <b>kind of</b> like a
<code>void*</code> in C or a pointer to a polymorphic base class in C++ but there
is a twist.  Two different <i>any</i> types are not compatible.  That is, an
instance of <i>any</i> type <code>Data1</code> can not be used to construct or update an
instance of <i>any</i> type <code>Data2</code>.
</p>

<p>
Another twist is that an instance of an <i>any</i> type may only be
constructed or updated with any other non-<i>any</i> "otype" (or an instance
of the same <i>any</i> type) but not any POD.  Despite that, an instance of
an <i>any</i> type can still be turned into POD with the usual <code>.pod()</code> method.
</p>

<div class="note">
<p>
An <i>any</i> type is used in a few places in the <code>appfwk</code> command schema
because the internals of <code>appfwk</code> require layers of <a href="https://en.wikipedia.org/wiki/Type_erasure">type erasure</a> so that
different types of commands and of modules can be accommodated while
retaining a generalized schema.  Without <i>any</i> wholly new schema would
have to be developed for every possible command type and every
possible combination of module implementations.
</p>

</div>

<p>
In the <code>appfwk</code> schema, we currently have one catch-all <i>any</i> type called <code>Data</code>.
</p>

<div class="warning">
<p>
The current version of <code>appfwk</code> schema uses a <b>single</b> <i>any</i> type called
<code>Data</code> for <b>every</b> point of type erasure.  Future versions of the schema
may define multiple <i>any</i> types in order to differentiate the different
semantics.  For example, to differentiate <code>Command.data</code> from <code>Init.data</code>.
</p>

</div>

<pre class="example">
In [7]: cmd.Data?
Init signature: cmd.Data(val)
Docstring:     
The any type Data.

Can hold any oschema type except Any types that are not Data.

An opaque object holding lower layer substructure
</pre>

<p>
As above, we must use <b>some</b> schema type instance to set an <i>any</i> type
instance.  Here we use <code>CmdId</code> for simplicity.  In a "real" command
object, the <i>any</i> type Data tends to hold some larger <i>record</i> type.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fcaf3e;">d1</span> = cmd.Data(cmd.CmdId(<span style="color: #e9b96e;">"conf"</span>))
d1.update(cmd.QueueKind(<span style="color: #e9b96e;">"StdDeQueue"</span>))
d1.pod()
</pre>
</div>

<pre class="example">
'StdDeQueue'
</pre>

<p>
Let's try to break it:
</p>

<pre class="example">
In [23]: d2 = cmd.Data("this should not work")
...
ValueError: any type Data requires oschema type

In [25]: moo.otypes.make_type(schema="any", name="Other", doc="Another any", path="test.junk")
In [26]: from test.junk import Other
In [28]: d3 = Other(d1)
...
ValueError: cross any updates not allowed
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaee67e4" class="outline-2">
<h2 id="orgaee67e4">Construct Commands</h2>
<div class="outline-text-2" id="text-orgaee67e4">
<p>
The schema corresponding to the <code>appfwk</code> commands with IDs <code>init</code> and <code>conf</code>
are simple but take some work to construct.  Besides setting values
which reside in fixed structure, their layers of type erasure (<i>any</i>
types) allow for whole substructure to be provided in a parameterized
manner.  We'll go through these two command objects separately.
</p>

<p>
Regardless of the type of command object, the top level structure is
provided by a simple schema with an ID and an <i>any</i>:
</p>

<pre class="example">
In [29]: cmd.Command?
Init signature:
cmd.Command(
    *args,
    id: dunedaq.appfwk.cmd.CmdId = None,
    data: dunedaq.appfwk.cmd.Data = None,
)
Docstring:     
Record type Command with fields: "id", "data"

Top-level command object structure
</pre>

<p>
The <code>data</code> field should be populated with a subobject of a type that
depends on the value of <code>id</code>.
</p>
</div>

<div id="outline-container-org725a1ce" class="outline-3">
<h3 id="org725a1ce">The <code>init</code> command</h3>
<div class="outline-text-3" id="text-org725a1ce">
<p>
The <code>init</code> command provides all the information to take a fully <b>generic</b>
<code>appfwk</code> application into one that has all of its queues and modules
constructed.  The queues are also fully configured by this <code>init</code>
command.  The modules receive notice of the <code>init</code> and may even require
custom <code>init</code> information but such is best left for <code>conf</code>.
</p>

<p>
The substructure for <code>Command.data</code> for an <code>init</code> command is a:
</p>

<pre class="example">
In [30]: cmd.Init?
Init signature:
cmd.Init(
    *args,
    queues: dunedaq.appfwk.cmd.QueueSpecs = None,
    modules: dunedaq.appfwk.cmd.ModSpecs = None,
)
Docstring:     
Record type Init with fields: "queues", "modules"

The app-level init command data object struction
</pre>

<p>
The <code>ModSpecs</code> are new:
</p>

<pre class="example">
In [32]: cmd.ModSpec?
Init signature:
cmd.ModSpec(
    *args,
    plugin: dunedaq.appfwk.cmd.PluginName = None,
    inst: dunedaq.appfwk.cmd.InstName = None,
    data: dunedaq.appfwk.cmd.Data = None,
)
Docstring:     
Record type ModSpec with fields: "plugin", "inst", "data"

Module specification
</pre>

<div class="note">
<p>
The <i>any</i> <code>Data</code> type is seen again here.  It is used, in principle, to
inject a module implementation specific object.  This is a "just in
case" feature.  Most modules should get their custom information as
part of their <code>conf</code> command object.
</p>

</div>

<p>
The simplest, and most boring, <code>init</code> command:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fcaf3e;">myinit</span> = cmd.Command(<span style="color: #e090d7;">id</span>=cmd.CmdId(<span style="color: #e9b96e;">"init"</span>), data=cmd.Init(queues=[], modules=[]))
myinit.pod()
</pre>
</div>

<pre class="example">
{'id': 'init', 'data': {'queues': [], 'modules': []}}
</pre>

<p>
That code has some redundancies so we can replace it with a little helper:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #b4fa70;">import</span> ddcmd
<span style="color: #fcaf3e;">myinit</span> = ddcmd.init()
myinit.pod()
</pre>
</div>

<pre class="example">
{'id': 'init', 'data': {'queues': [], 'modules': []}}
</pre>

<p>
As such, this <code>init</code> command would initialize an "empty" and rather
useless app instance.  The next two sections describe how to make the
queue and module sequences with a working example.
</p>
</div>

<div id="outline-container-orgb156e0b" class="outline-4">
<h4 id="orgb156e0b">Queue initialization</h4>
<div class="outline-text-4" id="text-orgb156e0b">
<p>
An <code>appfwk</code> queue is initialized with a <code>QueueSpec</code> which we introduced
already.  The only new thing to know is that a queue <code>inst</code> field
(instance name) must used be also in <b>two</b> places in the module init
objects.  That is, one or two modules need to know the queue name in
order to attach to its two endpoints.  
</p>

<p>
Keeping things simple, we make just one queue named <code>"host"</code>:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fcaf3e;">queues</span> = cmd.QueueSpecs([
  cmd.QueueSpec(kind=<span style="color: #e9b96e;">'StdDeQueue'</span>, inst=<span style="color: #e9b96e;">"hose"</span>, capacity=10)])
queues.pod()
</pre>
</div>

<pre class="example">
[{'kind': 'StdDeQueue', 'inst': 'hose', 'capacity': 10}]
</pre>
</div>
</div>
