ddcmd.org
*** Module initialized

An ~appfwk~ module is initialized with a ~ModSpec~, introduced above.
Here, we give initialization for the two "fake" test modules provided
by ~appfwk/test/~.

#+begin_src ipython :session :exports both :results raw drawer
modules = cmd.ModSpecs([
  cmd.ModSpec(inst="source", plugin="FakeDataProducerDAQModule",
    data=cmd.QueueInfo(inst="hose", name="output", dir="output")),
  cmd.ModSpec(inst="sink", plugin="FakeDataConsumerDAQModule",
    data=cmd.QueueInfo(inst="host", name="input", dir="input"))])
modules.pod()
#+end_src

#+RESULTS:
:results:
# Out[130]:
#+BEGIN_EXAMPLE
  [{'plugin': 'FakeDataProducerDAQModule',
  'inst': 'source',
  'data': {'inst': 'hose', 'name': 'output', 'dir': 'output'}},
  {'plugin': 'FakeDataConsumerDAQModule',
  'inst': 'sink',
  'data': {'inst': 'host', 'name': 'input', 'dir': 'input'}}]
#+END_EXAMPLE
:end:

** Putting ~init~ together

Let's use the little ~ddcmd.init()~ helper again to build a full ~init~ command.

#+begin_src ipython :session :exports both :results raw drawer
import ddcmd
myinit = ddcmd.init(queues=queues, modules=modules)
myinit.pod()
#+end_src

#+RESULTS:
:results:
# Out[131]:
#+BEGIN_EXAMPLE
  {'id': 'init',
  'data': {'queues': [{'kind': 'StdDeQueue', 'inst': 'hose', 'capacity': 10}],
  'modules': [{'plugin': 'FakeDataProducerDAQModule',
  'inst': 'source',
  'data': {'inst': 'hose', 'name': 'output', 'dir': 'output'}},
  {'plugin': 'FakeDataConsumerDAQModule',
  'inst': 'sink',
  'data': {'inst': 'host', 'name': 'input', 'dir': 'input'}}]}}
#+END_EXAMPLE
:end:


** The ~conf~ command

The ~conf~ command's /any/ typed ~.data~ holds module-level configuration
(sub) objects in a ~.modules~ attribute.  This attribute is of types
~AddressedCmds~ which is a /sequence/ of ~AddressedCmd~.

#+begin_example
In [14]: cmd.AddressedCmd?
Init signature:
cmd.AddressedCmd(
    *args,
    match: dunedaq.appfwk.cmd.Match = None,
    data: dunedaq.appfwk.cmd.Data = None,
)
Docstring:     
Record type AddressedCmd with fields: "match", "data"

General, non-init module-level command data structure
#+end_example

The ~Match~ type is a string to provide a regular expression.  All that
match will receive the object held in the /any/ type ~.data~.  For this
~conf~ command we will explicitly match the module names.

#+begin_warning
Currently ~Match~ allows any string.  Future work may improve this type
by providing a ~pattern~ which would be a regex that matches regex,
dawg.  For now, it relies on care.
#+end_warning

A skeleton for making the ~conf~ command object might look like:

#+begin_example
cmd.AddressedCmds([
  cmd.AddressedCmd(match="source", data=...),
  cmd.AddressedCmd(match="sink", data=...)])
#+end_example

We now turn to making the module-specific configuration objects.

*** Module configuration objects

Each ~appfwk~ module implementation (ie, the C++ subclass of ~DAQModule~)
defines its own configuration object schema.

#+begin_tip
Help on defining module configuration object schema can be found in
~appfwk/schema/README.org~ or online [[https://brettviren.github.io/moo/dunedaq-appfwk-schema.html][here]].
#+end_tip

As we did with the general ~appfwk~ level schema we must load the
module-level schema so that we may use corresponding Python types:

#+begin_src ipython :session :exports both :results raw drawer
import ddcmd
types = dict()
for mod in ["fdp", "fdc"]:
    schema = ddcmd.load_oschema(f"appfwk-{mod}-schema.jsonnet")
    these = ddcmd.make_otypes(schema)
    types.update(these)
types
#+end_src

#+RESULTS:
:results:
# Out[155]:
#+BEGIN_EXAMPLE
  {'dunedaq.appfwk.fdp.Size': dunedaq.appfwk.fdp.Size,
  'dunedaq.appfwk.fdp.Count': dunedaq.appfwk.fdp.Count,
  'dunedaq.appfwk.fdp.Conf': dunedaq.appfwk.fdp.Conf,
  'dunedaq.appfwk.fdc.Size': dunedaq.appfwk.fdc.Size,
  'dunedaq.appfwk.fdc.Count': dunedaq.appfwk.fdc.Count,
  'dunedaq.appfwk.fdc.Conf': dunedaq.appfwk.fdc.Conf}
#+END_EXAMPLE
:end:

#+begin_note
Note the different ~path~ attribute of the two schema are reflected into the Python module namespace.
#+end_note

#+begin_src ipython :session :exports both :results raw drawer
from dunedaq.appfwk import fdp
from dunedaq.appfwk import fdc
fdc.Conf()
#+end_src

#+RESULTS:
:results:
# Out[161]:
: <record Conf, fields: {nIntsPerVector, starting_int, ending_int, queue_timeout_ms}>
:end:

For both modules, the ~Conf~ type may be used to create the module-level
configuration object and both are similarly structured.  Here is the
producer:

#+begin_example
In [24]: fdp.Conf?
Init signature:
fdp.Conf(
    *args,
    nIntsPerVector: dunedaq.appfwk.fdp.Size = 10,
    starting_int: dunedaq.appfwk.fdp.Count = -4,
    ending_int: dunedaq.appfwk.fdp.Count = 14,
    queue_timeout_ms: dunedaq.appfwk.fdp.Count = 100,
    wait_between_sends_ms: dunedaq.appfwk.fdp.Count = 1000,
)
Docstring:     
Record type Conf with fields: "nIntsPerVector", "starting_int", "ending_int", "queue_timeout_ms", "wait_between_sends_ms"

Fake Data Producer DAQ Module Configuration
#+end_example

Both happen to provide defaults so that their default construction
results in a fully specified /record/ type instance.  We can thus fill
in the skeleton simply:

#+begin_src ipython :session :exports both :results raw drawer
ac = cmd.Command(id="conf", data=cmd.AddressedCmds([
  cmd.AddressedCmd(match="source", data=fdp.Conf()),
  cmd.AddressedCmd(match="sink", data=fdc.Conf())]))
ac.pod()
#+end_src

#+RESULTS:
:results:
# Out[164]:
#+BEGIN_EXAMPLE
  {'id': 'conf',
  'data': [{'match': 'source',
  'data': {'nIntsPerVector': 10,
  'starting_int': -4,
  'ending_int': 14,
  'queue_timeout_ms': 100,
  'wait_between_sends_ms': 1000}},
  {'match': 'sink',
  'data': {'nIntsPerVector': 10,
  'starting_int': -4,
  'ending_int': 14,
  'queue_timeout_ms': 100}}]}
#+END_EXAMPLE
:end:

Like with ~init~ we may provide a little helper:

#+begin_src ipython :session :exports both :results raw drawer
myconf = ddcmd.conf([
  cmd.AddressedCmd(match="source", data=fdp.Conf()),
  cmd.AddressedCmd(match="sink", data=fdc.Conf())])
myconf
#+end_src

#+RESULTS:
:results:
# Out[168]:
: <record Command, fields: {id, data}>
:end:

* Command delivery

Various means for delivery of commands to ~appfwk~ applications are in
development.  An initial approach is to use the same interactive REPL
that we used to build the command objects.  This is described in
[[file:ddrepl.org]].

* Internals
