ddcmd.html

<div id="outline-container-org733a525" class="outline-4">
<h4 id="org733a525">Module initialized</h4>
<div class="outline-text-4" id="text-org733a525">
<p>
An <code>appfwk</code> module is initialized with a <code>ModSpec</code>, introduced above.
Here, we give initialization for the two "fake" test modules provided
by <code>appfwk/test/</code>.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fcaf3e;">modules</span> = cmd.ModSpecs([
  cmd.ModSpec(inst=<span style="color: #e9b96e;">"source"</span>, plugin=<span style="color: #e9b96e;">"FakeDataProducerDAQModule"</span>,
    data=cmd.QueueInfo(inst=<span style="color: #e9b96e;">"hose"</span>, name=<span style="color: #e9b96e;">"output"</span>, <span style="color: #e090d7;">dir</span>=<span style="color: #e9b96e;">"output"</span>)),
  cmd.ModSpec(inst=<span style="color: #e9b96e;">"sink"</span>, plugin=<span style="color: #e9b96e;">"FakeDataConsumerDAQModule"</span>,
    data=cmd.QueueInfo(inst=<span style="color: #e9b96e;">"host"</span>, name=<span style="color: #e9b96e;">"input"</span>, <span style="color: #e090d7;">dir</span>=<span style="color: #e9b96e;">"input"</span>))])
modules.pod()
</pre>
</div>

<pre class="example">
[{'plugin': 'FakeDataProducerDAQModule',
'inst': 'source',
'data': {'inst': 'hose', 'name': 'output', 'dir': 'output'}},
{'plugin': 'FakeDataConsumerDAQModule',
'inst': 'sink',
'data': {'inst': 'host', 'name': 'input', 'dir': 'input'}}]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea14343" class="outline-3">
<h3 id="orgea14343">Putting <code>init</code> together</h3>
<div class="outline-text-3" id="text-orgea14343">
<p>
Let's use the little <code>ddcmd.init()</code> helper again to build a full <code>init</code> command.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #b4fa70;">import</span> ddcmd
<span style="color: #fcaf3e;">myinit</span> = ddcmd.init(queues=queues, modules=modules)
myinit.pod()
</pre>
</div>

<pre class="example">
{'id': 'init',
'data': {'queues': [{'kind': 'StdDeQueue', 'inst': 'hose', 'capacity': 10}],
'modules': [{'plugin': 'FakeDataProducerDAQModule',
'inst': 'source',
'data': {'inst': 'hose', 'name': 'output', 'dir': 'output'}},
{'plugin': 'FakeDataConsumerDAQModule',
'inst': 'sink',
'data': {'inst': 'host', 'name': 'input', 'dir': 'input'}}]}}
</pre>
</div>
</div>


<div id="outline-container-orgc5ad165" class="outline-3">
<h3 id="orgc5ad165">The <code>conf</code> command</h3>
<div class="outline-text-3" id="text-orgc5ad165">
<p>
The <code>conf</code> command's <i>any</i> typed <code>.data</code> holds module-level configuration
(sub) objects in a <code>.modules</code> attribute.  This attribute is of types
<code>AddressedCmds</code> which is a <i>sequence</i> of <code>AddressedCmd</code>.
</p>

<pre class="example">
In [14]: cmd.AddressedCmd?
Init signature:
cmd.AddressedCmd(
    *args,
    match: dunedaq.appfwk.cmd.Match = None,
    data: dunedaq.appfwk.cmd.Data = None,
)
Docstring:     
Record type AddressedCmd with fields: "match", "data"

General, non-init module-level command data structure
</pre>

<p>
The <code>Match</code> type is a string to provide a regular expression.  All that
match will receive the object held in the <i>any</i> type <code>.data</code>.  For this
<code>conf</code> command we will explicitly match the module names.
</p>

<div class="warning">
<p>
Currently <code>Match</code> allows any string.  Future work may improve this type
by providing a <code>pattern</code> which would be a regex that matches regex,
dawg.  For now, it relies on care.
</p>

</div>

<p>
A skeleton for making the <code>conf</code> command object might look like:
</p>

<pre class="example">
cmd.AddressedCmds([
  cmd.AddressedCmd(match="source", data=...),
  cmd.AddressedCmd(match="sink", data=...)])
</pre>

<p>
We now turn to making the module-specific configuration objects.
</p>
</div>

<div id="outline-container-org8125944" class="outline-4">
<h4 id="org8125944">Module configuration objects</h4>
<div class="outline-text-4" id="text-org8125944">
<p>
Each <code>appfwk</code> module implementation (ie, the C++ subclass of <code>DAQModule</code>)
defines its own configuration object schema.
</p>

<div class="tip">
<p>
Help on defining module configuration object schema can be found in
<code>appfwk/schema/README.org</code> or online <a href="https://brettviren.github.io/moo/dunedaq-appfwk-schema.html">here</a>.
</p>

</div>

<p>
As we did with the general <code>appfwk</code> level schema we must load the
module-level schema so that we may use corresponding Python types:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #b4fa70;">import</span> moo
<span style="color: #fcaf3e;">types</span> = <span style="color: #e090d7;">dict</span>()
<span style="color: #b4fa70;">for</span> mod <span style="color: #b4fa70;">in</span> [<span style="color: #e9b96e;">"FakeDataConsumerDAQModule"</span>, <span style="color: #e9b96e;">"FakeDataProducerDAQModule"</span>]:
    moo.otypes.load_types(f<span style="color: #e9b96e;">"appfwk-{mod}-schema.jsonnet"</span>)
    types.update(these)
types
</pre>
</div>

<pre class="example">
{'dunedaq.appfwk.fakedataconsumerdaqmodule.Size': dunedaq.appfwk.fakedataconsumerdaqmodule.Size,
'dunedaq.appfwk.fakedataconsumerdaqmodule.Count': dunedaq.appfwk.fakedataconsumerdaqmodule.Count,
'dunedaq.appfwk.fakedataconsumerdaqmodule.Conf': dunedaq.appfwk.fakedataconsumerdaqmodule.Conf}
</pre>

<div class="note">
<p>
Note the different <code>path</code> attribute of the two schema are reflected into the Python module namespace.
</p>

</div>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #b4fa70;">from</span> dunedaq.appfwk <span style="color: #b4fa70;">import</span> fakedataproducerdaqmodule <span style="color: #b4fa70;">as</span> fdp
<span style="color: #b4fa70;">from</span> dunedaq.appfwk <span style="color: #b4fa70;">import</span> fakedataconsumerdaqmodule <span style="color: #b4fa70;">as</span> fdc
fdc.Conf()
</pre>
</div>

<pre class="example">
&lt;record Conf, fields: {nIntsPerVector, starting_int, ending_int, queue_timeout_ms}&gt;
</pre>

<p>
For both modules, the <code>Conf</code> type may be used to create the module-level
configuration object and both are similarly structured.  Here is the
producer:
</p>

<pre class="example">
In [24]: fdp.Conf?
Init signature:
fdp.Conf(
    *args,
    nIntsPerVector: dunedaq.appfwk.fdp.Size = 10,
    starting_int: dunedaq.appfwk.fdp.Count = -4,
    ending_int: dunedaq.appfwk.fdp.Count = 14,
    queue_timeout_ms: dunedaq.appfwk.fdp.Count = 100,
    wait_between_sends_ms: dunedaq.appfwk.fdp.Count = 1000,
)
Docstring:     
Record type Conf with fields: "nIntsPerVector", "starting_int", "ending_int", "queue_timeout_ms", "wait_between_sends_ms"

Fake Data Producer DAQ Module Configuration
</pre>

<p>
Both happen to provide defaults so that their default construction
results in a fully specified <i>record</i> type instance.  We can thus fill
in the skeleton simply:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fcaf3e;">ac</span> = cmd.Command(<span style="color: #e090d7;">id</span>=<span style="color: #e9b96e;">"conf"</span>, data=cmd.AddressedCmds([
  cmd.AddressedCmd(match=<span style="color: #e9b96e;">"source"</span>, data=fdp.Conf()),
  cmd.AddressedCmd(match=<span style="color: #e9b96e;">"sink"</span>, data=fdc.Conf())]))
ac.pod()
</pre>
</div>

<pre class="example">
{'id': 'conf',
'data': [{'match': 'source',
'data': {'nIntsPerVector': 10,
'starting_int': -4,
'ending_int': 14,
'queue_timeout_ms': 100,
'wait_between_sends_ms': 1000}},
{'match': 'sink',
'data': {'nIntsPerVector': 10,
'starting_int': -4,
'ending_int': 14,
'queue_timeout_ms': 100}}]}
</pre>

<p>
Like with <code>init</code> we may provide a little helper:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fcaf3e;">myconf</span> = ddcmd.conf([
  cmd.AddressedCmd(match=<span style="color: #e9b96e;">"source"</span>, data=fdp.Conf()),
  cmd.AddressedCmd(match=<span style="color: #e9b96e;">"sink"</span>, data=fdc.Conf())])
myconf
</pre>
</div>

<pre class="example">
&lt;record Command, fields: {id, data}&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd8516de" class="outline-2">
<h2 id="orgd8516de">Command delivery</h2>
<div class="outline-text-2" id="text-orgd8516de">
<p>
Various means for delivery of commands to <code>appfwk</code> applications are in
development.  An initial approach is to use the same interactive REPL
that we used to build the command objects.  This is described in
<a href="ddrepl.html">ddrepl.html</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Viren Brett Viren</p>
<p class="date">Created: 2021-01-08 Fri 16:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
